#include <stdio.h>
#include <stdlib.h>

//打印出所有的“水仙花数”，所谓“水仙花”是指一个三位数，
//其各位数字立方和等于该数本身。
//例如：153是一个是“水仙花数”，因为153=1的三次方+5的三次方+3的三次方
// 错误案例(原来是可以实现的 就是把 == 打成了 = 导致错误)
//而且必须考十位和个位是0的情况
//算是方法一
int main()
{
    int m,n,i,x,y;
    for(m = 1; m<10;m++)
    {
        for(n = 0 ; n< 10 ; n++)
        {
            for(i = 0 ; i < 10 ;i++)
            {
                y = (m*m*m + n*n*n + i*i*i);
                x = m*100 + n*10 + i;
                if( y == x && y<1000)
                {printf("%d\n",x);}

            }
        }
    }
    return 0;
}
/* 方法二
//看了思路后
//先循环100-1000的数取个、十、百再三次方进行比对。
int main()
{
    int m,n,i,x,y;
    for(m=100;m < 1000; m++)
    {
        //个位
        n = m % 10;
        //十位
        i = m /10 %10;
        //百位
        x = m / 100;
        y = n*n*n + i*i*i +x*x*x;
        if(y == m)
        {
            printf("%d\n",y);

        }
    }


    return 0;

}*/



